{"format": "graph-model", "generatedBy": "2.1.0", "convertedBy": "TensorFlow.js Converter v1.6.0", "userDefinedMetadata": {"signature": {"outputs": {"NCHW_output": {"name": "NCHW_output"}}}}, "modelTopology": {"node": [{"name": "b3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "b2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "b1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "IteratorGetNext", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"unknownRank": true}}}}, {"name": "f1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "f2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "f3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "NCHW_output/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "conv1", "op": "Conv2D", "input": ["IteratorGetNext", "f1"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "add", "op": "Add", "input": ["b1", "conv1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Relu", "op": "Relu", "input": ["add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv2", "op": "Conv2D", "input": ["Relu", "f2"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "add_1", "op": "Add", "input": ["b2", "conv2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Relu_1", "op": "Relu", "input": ["add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv3", "op": "Conv2D", "input": ["Relu_1", "f3"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "add_2", "op": "Add", "input": ["b3", "conv3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "DepthToSpace", "op": "DepthToSpace", "input": ["add_2"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "block_size": {"i": "2"}}}, {"name": "NHWC_output", "op": "Tanh", "input": ["DepthToSpace"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "NCHW_output", "op": "Transpose", "input": ["NHWC_output", "NCHW_output/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}], "versions": {}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "b3", "shape": [4], "dtype": "float32"}, {"name": "b2", "shape": [32], "dtype": "float32"}, {"name": "b1", "shape": [64], "dtype": "float32"}, {"name": "f1", "shape": [5, 5, 1, 64], "dtype": "float32"}, {"name": "f2", "shape": [3, 3, 64, 32], "dtype": "float32"}, {"name": "f3", "shape": [3, 3, 32, 4], "dtype": "float32"}, {"name": "NCHW_output/perm", "shape": [4], "dtype": "int32"}]}]}